rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Batman"], ["rating", "PG-13"], ["release_date", "2014-01-05 00:00:00.000000"], ["created_at", "2018-03-19 19:20:12.514764"], ["updated_at", "2018-03-19 19:20:12.514764"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", "Ridley Scott"], ["updated_at", "2018-03-19 19:24:39.529711"], ["id", 3]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'George Lucas'
---
  def same_director
    @movie = Movie.find(params[:id])
    movie_director = @movie.director
    if movie_director.empty? then
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to movies_path
    else
      @movies = Movie.where(Director: movie_director)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 3]]
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy